HasDisplayStyle Method
 Indicates if view has a DisplayStyle property
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public bool HasDisplayStyle()
  Visual Basic
Public Function HasDisplayStyle As Boolean
  Visual C++
public:
bool HasDisplayStyle()
 Return Value
 True if view has a DisplayStyle property
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →